Repository: jimmylee16888/flutter_learning_app
Catalog: lib/l10n/app_*.arb
Languages: de, ja, ko, zh

# exportJsonSkipLocalHint
source: Cards with local-only images will be skipped
de: Karten mit ausschließlich lokalen Bildern werden übersprungen
ja: ローカルのみの画像を含むカードはスキップされます
ko: 로컬 이미지 전용 카드는 건너뜁니다
zh: 只含本地圖片的卡片將被略過

# triedShareSummary
source: Tried to share {total}, success {ok} / failed {fail}
de: {total} Freigaben versucht, erfolgreich {ok} / fehlgeschlagen {fail}
ja: {total} 件の共有を試行、成功 {ok}／失敗 {fail}
ko: {total}개 공유 시도, 성공 {ok} / 실패 {fail}
zh: 已嘗試分享 {total} 張，成功 {ok}／失敗 {fail}

source: Share QR code
de: QR-Code teilen
ja: QR コードを共有
ko: QR 코드 공유
zh: 分享 QR code

# shareQrAutoBackendHint
source: Large payloads switch to backend mode automatically
de: Bei großer Datenmenge wird automatisch in den Backend-Modus gewechselt
ja: データ量が多い場合は自動でバックエンドモードに切り替わります
ko: 데이터가 큰 경우 자동으로 백엔드 모드로 전환됩니다
zh: 資料過大會自動切換為後端模式

# cannotShareByQr
source: Cannot share via QR
de: Teilen per QR nicht möglich
ja: QR では共有できません
ko: QR로 공유할 수 없습니다
zh: 無法以 QR 分享

source: No image URL
de: Keine Bild-URL
ja: 画像 URL がありません
ko: 이미지 URL이 없음
zh: 沒有圖片網址

# noImageUrlPhotoOnly
source: No image URL; can only share the photo directly
de: Keine Bild-URL; nur direktes Teilen des Fotos möglich
ja: 画像 URL がないため、写真の直接共有のみ可能です
ko: 이미지 URL이 없어 사진 직접 공유만 가능합니다
zh: 沒有圖片網址；僅能直接分享照片

source: Share this photo
de: Dieses Foto teilen
ja: この写真を共有
ko: 이 사진 공유
zh: 分享此張照片

# shareFailed
source: Share failed: {error}
de: Teilen fehlgeschlagen: {error}
ja: 共有に失敗しました: {error}
ko: 공유 실패: {error}
zh: 分享失敗：{error}

# transportBackendHint
source: Backend mode (via API)
de: Backend-Modus (über API)
ja: バックエンドモード（API 経由）
ko: 백엔드 모드(API 사용)
zh: 後端模式（透過 API）

# transportEmbeddedHint
source: Embedded (local)
de: Eingebettet (lokal)
ja: 埋め込み（ローカル）
ko: 임베디드(로컬)
zh: 內嵌（本地）

# qrIdOnlyNotice
source: This QR contains only the card ID. The receiver will fetch full content from backend.
de: Dieser QR enthält nur die Karten-ID. Der Empfänger ruft die Inhalte vom Backend ab.
ja: この QR にはカード ID のみが含まれます。受信側はバックエンドから内容を取得します。
ko: 이 QR에는 카드 ID만 포함되어 있습니다. 수신 측에서 백엔드에서 전체 내용을 가져옵니다.
zh: 此 QR 僅包含卡片 ID。接收端會向後端取得完整內容。

# qrGenerationFailed
source: Failed to generate QR image
de: QR-Bild konnte nicht erzeugt werden
ja: QR 画像の生成に失敗しました
ko: QR 이미지 생성 실패
zh: 產生 QR 影像失敗

# pasteJsonTitle
source: Paste JSON text
de: JSON-Text einfügen
ja: JSON テキストを貼り付け
ko: JSON 텍스트 붙여넣기
zh: 貼上 JSON 文字

# pasteJsonHint
source: Supports mini_card_bundle_v2/v1 or mini_card_v2/v1
de: Unterstützt mini_card_bundle_v2/v1 oder mini_card_v2/v1
ja: mini_card_bundle_v2/v1 または mini_card_v2/v1 をサポート
ko: mini_card_bundle_v2/v1 또는 mini_card_v2/v1 지원
zh: 支援 mini_card_bundle_v2/v1 或 mini_card_v2/v1

source: Import
de: Importieren
ja: インポート
ko: 가져오기
zh: 匯入

# importedFromJsonToast
source: Imported {n} mini card(s) from JSON
de: {n} Mini-Cards aus JSON importiert
ja: JSON から {n} 枚のミニカードをインポートしました
ko: JSON에서 미니 카드 {n}장을 가져왔습니다
zh: 已自 JSON 匯入 {n} 張小卡

# importFailed
source: Import failed: {error}
de: Import fehlgeschlagen: {error}
ja: インポートに失敗しました: {error}
ko: 가져오기 실패: {error}
zh: 匯入失敗：{error}

# cannotExportJsonAllLocal
source: All selected cards contain local-only images and cannot be exported to JSON
de: Alle ausgewählten Karten enthalten nur lokale Bilder und können nicht als JSON exportiert werden
ja: 選択したカードはすべてローカル画像のみのため、JSON にエクスポートできません
ko: 선택한 카드가 모두 로컬 이미지 전용이어서 JSON으로 내보낼 수 없습니다
zh: 所選卡片皆為僅含本地圖片，無法匯出為 JSON

# skippedLocalImagesCount
source: Skipped {n} card(s) that contain local-only images
de: {n} Karte(n) mit nur lokalen Bildern übersprungen
ja: ローカル画像のみのカード {n} 枚をスキップしました
ko: 로컬 이미지 전용 카드 {n}장을 건너뜀
zh: 已略過 {n} 張僅含本地圖片的卡片

source: Close
de: Schließen
ja: 閉じる
ko: 닫기
zh: 關閉

source: Copy
de: Kopieren
ja: コピー
ko: 복사
zh: 複製

# copiedJsonToast
source: Copied JSON
de: JSON kopiert
ja: JSON をコピーしました
ko: JSON을 복사했습니다
zh: 已複製 JSON

source: Copy JSON
de: JSON kopieren
ja: JSON をコピー
ko: JSON 복사
zh: 複製 JSON

source: None
de: Keine
ja: なし
ko: 없음
zh: 無

# selectCardsToShareTitle
source: Select cards to share
de: Karten zum Teilen auswählen
ja: 共有するカードを選択
ko: 공유할 카드 선택
zh: 選擇要分享的卡片

# hasImageUrlJsonOk
source: Has image URL; can be sent via JSON
de: Bild-URL vorhanden; Versand per JSON möglich
ja: 画像 URL あり：JSON で送信可能
ko: 이미지 URL 있음: JSON으로 전송 가능
zh: 有圖片網址；可用 JSON 傳送

# exportJsonOnlyUrlHint
source: Tip: Exported JSON includes only cards with an image URL; local-only images will be skipped.
de: Hinweis: Exportiertes JSON enthält nur Karten mit Bild-URL; nur lokale Bilder werden übersprungen.
ja: ヒント：エクスポートされる JSON には画像 URL を持つカードのみ含まれます。ローカルのみの画像はスキップされます。
ko: 팁: 내보낸 JSON에는 이미지 URL이 있는 카드만 포함됩니다. 로컬 전용 이미지는 건너뜁니다.
zh: 提示：匯出的 JSON 只包含有圖片網址的卡片；僅本地圖片將被略過。

source: Share photos
de: Fotos teilen
ja: 写真を共有
ko: 사진 공유
zh: 分享照片

source: Contains local images
de: Enthält lokale Bilder
ja: ローカル画像を含む
ko: 로컬 이미지 포함
zh: 包含本地圖片

# containsLocalImagesDetail
source: {blocked} card(s) cannot be exported to JSON. Export only the usable {allowed} card(s)?
de: {blocked} Karte(n) können nicht als JSON exportiert werden. Nur die verwendbaren {allowed} Karte(n) exportieren?
ja: {blocked} 枚は JSON にエクスポートできません。利用可能な {allowed} 枚のみをエクスポートしますか？
ko: {blocked}장은 JSON으로 내보낼 수 없습니다. 사용 가능한 {allowed}장만 내보낼까요?
zh: {blocked} 張卡片無法匯出為 JSON。是否只匯出可用的 {allowed} 張？

# onlyExportUsable
source: Export usable only
de: Nur verwendbare exportieren
ja: 利用可能なものだけをエクスポート
ko: 사용 가능한 것만 내보내기
zh: 僅匯出可用項目

# shareMiniCardTitle
source: Share mini card
de: Mini-Card teilen
ja: ミニカードを共有
ko: 미니 카드 공유
zh: 分享小卡

# qrTooLargeUseJsonHint
source: If the QR code fails to render, the data might be too large. Consider using JSON instead.
de: Wenn der QR-Code nicht angezeigt wird, sind die Daten evtl. zu groß. Nutzen Sie stattdessen JSON.
ja: QR コードが表示されない場合、データが大きすぎる可能性があります。JSON の使用を検討してください。
ko: QR 코드가 표시되지 않으면 데이터가 너무 클 수 있습니다. JSON 사용을 고려하세요.
zh: 若 QR 無法顯示，可能資料過大，建議改用 JSON。

# scanMiniCardQrTitle
source: Scan mini card QR
de: Mini-Card-QR scannen
ja: ミニカードの QR をスキャン
ko: 미니 카드 QR 스캔
zh: 掃描小卡 QR

source: Scan from gallery
de: Aus Galerie scannen
ja: ギャラリーからスキャン
ko: 갤러리에서 스캔
zh: 從相簿掃描

# noQrFoundInImage
source: No QR found in the image
de: Kein QR im Bild gefunden
ja: 画像内に QR が見つかりませんでした
ko: 이미지에서 QR을 찾지 못했습니다
zh: 圖片中未偵測到 QR

source: QR format invalid
de: QR-Format ungültig
ja: QR の形式が不正です
ko: QR 형식이 올바르지 않습니다
zh: QR 格式不正確

source: QR type unsupported
de: QR-Typ wird nicht unterstützt
ja: サポートされていない QR 種類です
ko: 지원되지 않는 QR 유형입니다
zh: 不支援的 QR 類型

# fetchFromBackendFailed
source: Failed to fetch from backend: {error}
de: Abruf vom Backend fehlgeschlagen: {error}
ja: バックエンドからの取得に失敗しました: {error}
ko: 백엔드에서 가져오기 실패: {error}
zh: 向後端取資料失敗：{error}

# addFollowedTagFailedOffline
source: You are offline. Tag added locally.
de: Du bist offline. Tag wurde lokal hinzugefügt.
ja: オフラインです。タグをローカルに追加しました。
ko: 오프라인입니다. 태그가 로컬에 추가되었습니다.
zh: 目前離線，已先在本機加入標籤

# removeFollowedTagFailedOffline
source: You are offline. Tag removed locally.
de: Du bist offline. Tag wurde lokal entfernt.
ja: オフラインです。タグをローカルで削除しました。
ko: 오프라인입니다. 태그가 로컬에서 제거되었습니다.
zh: 目前離線，已先在本機移除標籤

source: Loading…
de: Wird geladen …
ja: 読み込み中…
ko: 불러오는 중…
zh: 載入中…

# networkRequiredTitle
source: Network Required
de: Netzwerkverbindung erforderlich
ja: ネットワーク接続が必要です
ko: 네트워크 연결이 필요합니다
zh: 需要網路連線

# networkRequiredBody
source: Sign-in requires an internet connection. Please connect and try again.
de: Für die Anmeldung ist eine Internetverbindung erforderlich. Bitte verbinden Sie sich und versuchen Sie es erneut.
ja: サインインにはインターネット接続が必要です。接続してから、もう一度お試しください。
ko: 로그인하려면 인터넷 연결이 필요합니다. 연결 후 다시 시도해 주세요.
zh: 登入需要網路連線，請連線後再試一次。

source: OK
ko: 확인
zh: 知道了

source: Will save as
de: Wird gespeichert als
ja: 次の名前で保存します
ko: 다음 이름으로 저장합니다
zh: 將會儲存為

source: Already exists
de: Bereits vorhanden
ja: 既に存在します
ko: 이미 존재합니다
zh: 已存在

# common_about
source: About
de: Info
ja: 概要
zh: 關於

# settings_menu_general
source: General settings
de: Allgemeine Einstellungen
ja: 一般設定
zh: 一般設定

# settings_menu_user
source: User settings
de: Benutzereinstellungen
ja: ユーザー設定
zh: 使用者設定

# settings_menu_about
source: About
de: Info
ja: 概要
zh: 關於

# settingsMenuGeneral
source: General settings
de: Allgemeine Einstellungen
ja: 一般設定
zh: 一般設定

# commonAbout
source: About
de: Info
ja: 概要
zh: 關於

# navMore
source: More
de: Mehr
ja: その他
zh: 更多

# exploreReflow
source: Reflow widgets
de: Widgets neu anordnen
ja: ウィジェットを整列
zh: 元件歸位

# commonAdd
source: Add
de: Hinzufügen
ja: 追加
zh: 新增

# exploreNoPhoto
source: No photo selected
de: Kein Foto ausgewählt
ja: 写真が未選択です
zh: 未選擇照片

# exploreTapToEditQuote
source: Tap to edit quote
de: Tippen, um Zitat zu bearbeiten
ja: タップして引用を編集
zh: 點一下編輯引言

# exploreAdd
source: Add
de: Hinzufügen
ja: 追加
zh: 新增

# exploreAddPhoto
source: Photo card
de: Foto-Karte
ja: 写真カード
zh: 照片卡

# exploreAddQuote
source: Quote card
de: Zitat-Karte
ja: 引用カード
zh: 引言卡

# exploreAddBirthday
source: Birthday countdown
de: Geburtstags-Countdown
ja: 誕生日カウントダウン
zh: 生日倒數

# exploreAddBall
source: Add ball
de: Ball hinzufügen
ja: ボールを追加
zh: 新增小球

# exploreAdBuiltIn
source: Ad is built-in
de: Anzeigen sind integriert
ja: 広告は内蔵されています
zh: 廣告已內建

# exploreEnterAQuote
source: Enter a quote
de: Ein Zitat eingeben
ja: 引用文を入力
zh: 輸入一句話

# commonCancel
source: Cancel
de: Abbrechen
ja: キャンセル
zh: 取消

# commonOk
source: OK
zh: 確定

# exploreCountdownTitleHint
source: Idol/event (e.g. Sakura Birthday)
de: Idol/Ereignis (z. B. Sakura Geburtstag)
ja: アイドル／イベント名（例：さくら誕生日）
zh: 偶像／事件名稱（例如：Sakura 生日）

# exploreAddBallDialogTitle
source: Add ball
de: Ball hinzufügen
ja: ボールを追加
zh: 新增小球

# exploreBallEmojiHint
source: Emoji (leave empty to use a photo)
de: Emoji (leer lassen für Foto)
ja: 絵文字（空なら写真を使用）
zh: Emoji（留空則使用相片）

# exploreSize
source: Size
de: Größe
ja: サイズ
zh: 大小

# explorePickPhoto
source: Pick a photo…
de: Foto auswählen…
ja: 写真を選択…
zh: 選擇相片…

# explorePickedPhoto
source: Photo selected
de: Foto ausgewählt
ja: 写真を選択しました
zh: 已選擇相片

# navDex
source: Dex
de: Pokédex
ja: 図鑑
zh: 圖鑑

# dex_title
source: My Dex
de: Mein Pokédex
ja: マイ図鑑
zh: 我的圖鑑

# dex_uncategorized
source: Uncategorized
de: Nicht kategorisiert
ja: 未分類
zh: 未分類

# dex_searchHint
source: Search idols or cards…
de: Idole oder Karten suchen…
ja: アイドルやカードを検索…
zh: 搜尋偶像或卡片…

# dex_cardsCount
source: {count} cards
de: {count} Karten
ja: {count} 枚
zh: {count} 張

# dex_empty
source: No cards collected yet
de: Noch keine Karten gesammelt
ja: まだカードを収集していません
zh: 目前還沒有蒐集到卡片

source: Zoom in
de: Vergrößern
ja: 拡大
zh: 放大

source: Zoom out
de: Verkleinern
ja: 縮小
zh: 縮小

source: Reset zoom
de: Zoom zurücksetzen
ja: 拡大率をリセット
zh: 重設縮放

# billing_title
source: Subscription & Billing
de: Abonnement & Zahlung
ja: サブスクリプションとお支払い
zh: 訂閱與付款

# plan_free
source: Free
ja: フリー
zh: 免費

# plan_basic
source: Basic
ja: ベーシック
zh: 基本

# plan_pro
source: Pro
ja: プロ
zh: 專業

# plan_plus
source: Plus
ja: プラス
zh: 進階

# billing_current_plan
source: Current plan: {plan}
de: Aktueller Plan: {plan}
ja: 現在のプラン：{plan}
zh: 目前方案：{plan}

# section_plan_notes
source: Plan notes
de: Hinweise zu den Plänen
ja: プランの説明
zh: 方案說明

# section_payment_invoice
source: Payment and receipts (via Google Play)
de: Zahlung und Belege (über Google Play)
ja: お支払いと領収書（Google Play により提供）
zh: 付款與發票（由 Google Play 提供）

# section_terms
source: Terms (demo)
de: Bedingungen (Demo)
ja: 利用規約（デモ）
zh: 條款（示意）

# upgrade_card_title
source: Upgrade storage, collect freely
de: Speicher erweitern, entspannt sammeln
ja: 容量をアップして、もっと気軽に収集
zh: 升級空間，收藏無負擔

# upgrade_card_desc
source: Paid plans will unlock local uploads, larger storage, and multi-device sync.
de: Mit den Bezahlplänen kommen lokale Uploads, mehr Speicher und Geräte-Sync.
ja: 有料プランでローカル画像のアップロード・大容量・複数端末同期が解放されます。
zh: 付費方案將開放本地圖片上傳與更大空間，並支援多裝置同步。

# badge_coming_soon
source: Coming soon
de: Bald verfügbar
ja: 近日公開
zh: 即將上線

# feature_external_images
source: 5 GB cloud storage (multi-device sync)
de: 5 GB Cloud-Speicher (geräteübergreifende Synchronisierung)
ja: クラウド容量 5GB（デバイス間同期）
zh: 雲端空間 5 GB ( 跨裝置同步 )

# feature_small_cloud_space
source: Card categorization, card back info, mini-card details
de: Kartenkategorisierung, Kartenrückseite, Mini-Karten-Details
ja: カード分類、カード裏面情報、ミニカード詳細
zh: 卡片分類功能，卡背、小卡詳細資訊

# feature_ad_free
source: Ad-free immersive experience
de: Werbefreies, immersives Erlebnis
ja: 広告なしの没入型体験
zh: 無廣告沉浸體驗

# feature_upload_local_images
source: 10 GB cloud storage (multi-device sync)
de: 10 GB Cloud-Speicher (geräteübergreifende Synchronisierung)
ja: クラウド容量 10GB（デバイス間同期）
zh: 雲端空間 10 GB ( 跨裝置同步 )

# feature_priority_support
source: Card categorization, card back info, mini-card details
de: Kartenkategorisierung, Kartenrückseite, Mini-Karten-Details
ja: カード分類、カード裏面情報、ミニカード詳細
zh: 卡片分類功能，卡背、小卡詳細資訊

# feature_large_storage
source: 50 GB cloud storage (multi-device sync)
de: 50 GB Cloud-Speicher (geräteübergreifende Synchronisierung)
ja: クラウド容量 50GB（デバイス間同期）
zh: 雲端空間 50 GB ( 跨裝置同步 )

# feature_album_report
source: Card categorization, card back info, mini-card details
de: Kartenkategorisierung, Kartenrückseite, Mini-Karten-Details
ja: カード分類、カード裏面情報、ミニカード詳細
zh: 卡片分類功能，卡背、小卡詳細資訊

# feature_roadmap_advance
source: Advanced features (coming soon)
de: Erweiterte Funktionen (Vorschau)
ja: 上級機能（予告）
zh: 進階功能（預告）

# plan_badge_recommended
source: Recommended
de: Empfohlen
ja: おすすめ
zh: 推薦

# price_per_month
source: {price}/mo
de: {price}/Monat
ja: {price}/月
zh: {price}/月

source: Upgrade now
de: Jetzt upgraden
ja: 今すぐアップグレード
zh: 立即升級

source: Manage plan
de: Plan verwalten
ja: プラン管理
zh: 管理方案

# coming_soon_title
source: Not available yet
de: Noch nicht verfügbar
ja: 準備中です
zh: 功能即將開放

# coming_soon_body
source: Local cloud storage is being prepared for launch. This is a placeholder. The official release will include local uploads, larger capacity, and multi-device sync. Stay tuned!
de: Der lokale Cloud-Speicher wird derzeit für den Start vorbereitet. Dies ist eine Platzhalter-Ansicht. In der finalen Version gibt es lokale Uploads, mehr Speicher und Geräte-Sync.
ja: ローカルクラウド容量は現在リリース準備中です。今はプレースホルダー表示となります。正式版ではローカル画像アップロード・大容量・複数端末同期を提供予定です。お楽しみに！
zh: 目前「本地雲端空間」仍在加緊上線準備中，現在僅做佔位展示。正式版本將開放本地圖片上傳、更大容量與多裝置同步，敬請期待！

# coming_soon_ok
source: OK
zh: 好

# bullet_free_external
source: Free plan: external images (URLs) only
de: Gratis-Plan: Nur externe Bilder (URL) erlaubt
ja: 無料プラン：外部画像（URL）のみ利用可
zh: 免費方案：僅允許使用「外部圖片（網址）」

# bullet_paid_local_upload
source: Paid plans: upload local images to cloud with larger storage
de: Bezahlplan: Lokale Uploads in die Cloud mit mehr Speicher
ja: 有料プラン：ローカル画像のアップロードと大容量を提供
zh: 付費方案：可上傳本地圖片到雲端，提供更大容量

# bullet_future_tiers
source: More storage tiers will be available later
de: Weitere Speicherstufen folgen
ja: 今後、容量の段階を拡充予定
zh: 未來將提供更多容量級距

# bullet_pay_cards
source: Only Google Play Billing subscriptions are supported
de: Es werden nur Abonnements über Google Play Billing unterstützt
ja: 現在は Google Play の定期購入（アプリ内課金）のみ対応しています
zh: 目前僅支援 Google Play 內建訂閱與付款

# bullet_einvoice
source: Receipts/invoices are issued by Google Play; corporate tax IDs are not supported
de: Quittungen/Rechnungen werden von Google Play ausgestellt; Unternehmens-Steuernummern werden nicht unterstützt
ja: 領収書／請求書は Google Play により発行されます。法人向けの請求情報（法人番号等）には対応していません
zh: 收據／發票由 Google Play 開立；企業統編不適用

# bullet_cancel_anytime
source: Cancel anytime; no renewal next cycle
de: Jederzeit kündbar – keine Verlängerung im nächsten Monat
ja: いつでも解約可能。次回以降は課金されません
zh: 可隨時取消，下期不續扣

# bullet_terms
source: Terms of Service, Privacy Policy, Refund Policy (links to be added)
de: Nutzungsbedingungen, Datenschutz, Rückerstattungen (Links folgen)
ja: 利用規約・プライバシー・返金ポリシー（後日リンク追加）
zh: 服務條款、隱私權政策、退款政策（之後補連結）

# bullet_abuse
source: Abusive/illegal uploads may lead to suspension
de: Missbräuchliche/illegale Uploads führen zur Sperrung
ja: 不正・違法なアップロードはアカウント停止の対象
zh: 濫用上傳（如違法內容）將被停權

# common_ok
source: OK
zh: 確定

# common_okDescription
source: Generic OK/confirm button label.
de: Allgemeine OK-Schaltfläche
ja: 汎用のOKボタン
zh: 通用確定按鈕

# common_cancel
source: Cancel
de: Abbrechen
ja: キャンセル
zh: 取消

# common_cancelDescription
source: Generic cancel button label.
de: Allgemeine Abbrechen-Schaltfläche
ja: 汎用のキャンセルボタン
zh: 通用取消按鈕

# tutorial_title
source: Tutorial
de: Anleitung
ja: 使い方ガイド
zh: 使用教學

# tutorial_tab_cards
source: Cards
de: Karten
ja: カード
zh: 卡片

# tutorial_tab_social
source: Social
ja: ソーシャル
zh: 社群

# tutorial_tab_explore
source: Explore
de: Entdecken
ja: エクスプロア
zh: 探索

# tutorial_tab_more
source: More
de: Mehr
ja: その他
zh: 更多

# tutorial_cards_tags_addArtist
source: Add artist card
de: Artist-Karte hinzufügen
ja: アーティストカードを追加
zh: 新增藝人卡

# tutorial_cards_tags_addMini
source: Add mini card
de: Mini-Karte hinzufügen
ja: ミニカードを追加
zh: 新增小卡

# tutorial_cards_tags_editDelete
source: Edit / Delete
de: Bearbeiten / Löschen
ja: 編集 / 削除
zh: 編輯 / 刪除

# tutorial_cards_tags_info
source: Mini card info
de: Mini-Karteninfos
ja: ミニカード情報
zh: 小卡資訊

# tutorial_cards_addArtist_title
source: Add “Artist Card”
de: „Artist-Karte“ hinzufügen
ja: 「アーティストカード」を追加
zh: 新增「藝人卡」

# tutorial_cards_addArtist_s1
source: Tap “＋ Add artist card” at the bottom-right of the Cards page.
de: Tippe rechts unten auf „＋ Artist-Karte hinzufügen“.
ja: カード画面右下の「＋」をタップ。
zh: 在卡片頁右下角點「＋ 新增藝人卡」。

# tutorial_cards_addArtist_s2
source: Choose a local image or paste an online image URL.
de: Wähle ein lokales Bild oder füge eine Bild-URL ein.
ja: ローカル画像を選ぶか、画像URLを貼り付けます。
zh: 可選本機圖片或貼上網路圖片網址。

# tutorial_cards_addArtist_s3
source: Swipe right to edit artist info; swipe left to delete the artist card.
de: Wische rechts zum Bearbeiten, links zum Löschen der Karte.
ja: 右スワイプ：情報編集、左スワイプ：カード削除。
zh: 向右滑：編輯藝人資訊；向左滑：刪除藝人卡。

# tutorial_cards_addMini_title
source: Add “Mini Card”
de: „Mini-Karte“ hinzufügen
ja: 「ミニカード」を追加
zh: 新增「小卡」

# tutorial_cards_addMini_s1
source: Tap any “artist card” to enter its detail.
de: Tippe eine beliebige „Artist-Karte“, um Details zu öffnen.
ja: 任意の「アーティストカード」をタップして詳細へ。
zh: 點任一「藝人卡」進入內容。

# tutorial_cards_addMini_s2
source: Tap the mini-card area or swipe up → enter mini-card viewer.
de: Tippe den Mini-Kartenbereich oder wische nach oben → Viewer.
ja: 下部のミニカード領域をタップ／上スワイプ → ビューアへ。
zh: 點下方小卡區域或上滑 → 進入小卡檢視頁。

# tutorial_cards_addMini_s3
source: The leftmost/rightmost pages let you scan QR or open editor to add.
de: Ganz links/rechts: QR scannen oder Editor zum Hinzufügen öffnen.
ja: 最左／最右ページでQR読み取りや編集を開けます。
zh: 最左 / 最右頁可掃描 QR 或開啟小卡編輯新增。

# tutorial_cards_addMini_s4
source: Tap the “＋” on the editor to add; the same page supports delete.
de: „＋“ unten rechts im Editor zum Hinzufügen; Löschen auf derselben Seite.
ja: 編集画面右下の「＋」で追加。同画面で削除も可能。
zh: 編輯頁右下角「＋」新增；同頁可刪除。

# tutorial_cards_info_title
source: Manage “Mini Card Info”
de: „Mini-Karteninfos“ verwalten
ja: 「ミニカード情報」を管理
zh: 管理「小卡資訊」

# tutorial_cards_info_s1
source: After adding, the mini card appears in the viewer; tap to flip.
de: Nach dem Hinzufügen erscheint die Karte im Viewer; tippe zum Umdrehen.
ja: 追加後はビューアに表示。タップで裏返し。
zh: 小卡新增後出現在小卡檢視頁，點擊可翻面。

# tutorial_cards_info_s2
source: On the back → “Info” to edit: name, serial, album, type, notes, tags.
de: Oben rechts „Info“: Name, Nummer, Album, Typ, Notiz, Tags bearbeiten.
ja: 裏面右上の「情報」で、名前／番号／アルバム／種類／メモ／タグを編集。
zh: 背面右上「資訊」可編輯：名稱、序號、專輯、卡種、備註、標籤。

# tutorial_cards_info_s3
source: With tags, you can filter faster and search more precisely.
de: Mit Tags filterst du schneller und suchst präziser.
ja: タグで素早く絞り込み、検索精度も向上。
zh: 加上標籤後，在檢視頁可快速分類、搜尋更精準。

# tutorial_cards_note_json
source: Tip: The mini-card viewer (top-right) supports JSON download and batch import.
de: Tipp: Rechts oben kannst du JSON herunterladen und Stapelimport nutzen.
ja: ヒント：右上からJSONダウンロードと一括インポートに対応。
zh: 提示：小卡檢視頁右上支援 JSON 下載與批次匯入。

# tutorial_social_tags_primary
source: Friends / Hot / Following
de: Freunde / Trends / Folgen
ja: 友達 / 注目 / フォロー
zh: 好友 / 熱門 / 追蹤

# tutorial_social_tags_postComment
source: Post & comment
de: Posten & kommentieren
ja: 投稿とコメント
zh: 發文與評論

# tutorial_social_tags_lists
source: List management
de: Listen verwalten
ja: リスト管理
zh: 名單管理

# tutorial_social_browse_title
source: Browse posts
de: Beiträge ansehen
ja: 投稿を閲覧
zh: 瀏覽貼文

# tutorial_social_browse_s1
source: Switch tabs on top: “Friends”, “Hot”, “Following”.
de: Oben zwischen „Freunde“, „Trends“, „Folgen“ wechseln.
ja: 上部タブで「友達」「注目」「フォロー」を切替。
zh: 上方分頁切換到「好友」、「熱門」、「追蹤」。

# tutorial_social_browse_s2
source: All tabs support browsing, liking, and commenting.
de: In allen Tabs kannst du ansehen, liken und kommentieren.
ja: 各タブで閲覧・いいね・コメントが可能。
zh: 各分頁皆可瀏覽、按讚與留言互動。

# tutorial_social_post_title
source: Post & comment
de: Posten & kommentieren
ja: 投稿とコメント
zh: 發文與評論

# tutorial_social_post_s1
source: Use the bottom-right “pencil” to post.
de: Rechts unten mit dem „Stift“ posten.
ja: 右下の「えんぴつ」ボタンで投稿。
zh: 右下角「鉛筆」按鈕發文。

# tutorial_social_post_s2
source: Your post appears in “Hot” and “Friends” (friends can interact).
de: Dein Beitrag erscheint in „Trends“ und „Freunde“ (Freunde können interagieren).
ja: 投稿は「注目」と「友達」に表示（友達は交流可能）。
zh: 你的文章會出現在「熱門」與「好友」分頁（好友可互動）。

# tutorial_social_list_title
source: Manage lists
de: Listen verwalten
ja: リスト管理
zh: 名單管理

# tutorial_social_list_s1
source: Top-right “#”: edit friends list.
de: Oben rechts „#“: Freundesliste bearbeiten.
ja: 右上の「#」：友達リストを編集。
zh: 右上「#」：編輯好友名單。

# tutorial_social_list_s2
source: Top-right “card”: edit following list.
de: Oben rechts „Karte“: Following-Liste bearbeiten.
ja: 右上の「名刺」：フォローリストを編集。
zh: 右上「名片」：編輯追蹤名單。

# tutorial_explore_wall_title
source: Create idol wallpapers
de: Idol-Wallpaper gestalten
ja: 推し壁紙を自由に作成
zh: 自由打造偶像桌布

# tutorial_explore_wall_s1
source: Place photos, slogans, stickers to craft your style.
de: Fotos, Slogans, Sticker – ganz nach deinem Stil.
ja: 写真・スローガン・ステッカーで自分好みに。
zh: 放上照片與標語、貼紙，建立個人化風格。

# tutorial_explore_wall_s2
source: Add a “Birthday countdown” widget for support projects.
de: „Geburtstags-Countdown“-Widget hinzufügen.
ja: 「誕生日カウントダウン」ウィジェットも追加可能。
zh: 可加入「生日倒數」小工具，做應援佈置。

# tutorial_more_settings_title
source: Settings & User
de: Einstellungen & Benutzer
ja: 設定とユーザー
zh: 設定與使用者

# tutorial_more_settings_s1
source: “Settings”: theme, language, notification preferences.
de: „Einstellungen“: Thema, Sprache, Benachrichtigungen.
ja: 「設定」：テーマ・言語・通知など。
zh: 「設定」：主題、語言、通知等偏好。

# tutorial_more_settings_s2
source: “User settings”: nickname, avatar, sign-in methods.
de: „Benutzereinstellungen“: Spitzname, Avatar, Login-Methoden.
ja: 「ユーザー設定」：ニックネーム・アイコン・ログイン方法。
zh: 「使用者設定」：暱稱、頭像、登入方式等。

# tutorial_more_stats_title
source: Statistics
de: Statistik
ja: 統計
zh: 統計

# tutorial_more_stats_s1
source: See collected artists, mini-card count, and source (local / online).
de: Künstler, Mini-Kartenzahl, Quelle (lokal/online) ansehen.
ja: アーティスト数、ミニカード数、出所（ローカル／オンライン）を確認。
zh: 查看蒐集的藝人、小卡張數、來源（本地 / 線上）。

# tutorial_more_stats_s2
source: Leaderboards and achievements record your collection journey.
de: Ranglisten & Achievements zeichnen deine Sammlung nach.
ja: ランキングや実績でコレクションの軌跡を記録。
zh: 排行榜與成就，記錄你的收藏歷程。

# tutorial_more_dex_title
source: Dex
ja: 図鑑
zh: 圖鑑

# tutorial_more_dex_s1
source: Quickly overview all cards; supports search and filters.
de: Alle Karten im Überblick; Suche & Filter verfügbar.
ja: すべてのカードを一覧。検索やフィルタに対応。
zh: 快速總覽所有卡片；支援搜尋與篩選。

# tutorial_faq_q1
source: How to quickly add many mini cards?
de: Wie füge ich schnell viele Mini-Karten hinzu?
ja: ミニカードを一気に追加する方法は？
zh: 如何快速新增多張小卡？

# tutorial_faq_a1
source: In the mini card view page, there are two buttons at the top right. The left button supports batch importing JSON files, and the right button allows you to download the JSON file for this artist’s cards.
de: Auf der Mini-Karten-Ansichtsseite befinden sich oben rechts zwei Schaltflächen. Die linke Schaltfläche unterstützt das Batch-Importieren von JSON-Dateien, und über die rechte Schaltfläche kannst du die JSON-Datei der Karten dieses Künstlers herunterladen.
ja: ミニカード閲覧ページの右上には2つのボタンがあります。左側のボタンはJSONファイルの一括追加に対応し、右側のボタンではそのアーティストのカードJSONファイルをダウンロードできます。
zh: 在小卡檢視頁右下角按「＋」可連續新增，完成後回到檢視頁批次管理。
