Repository: jimmylee16888/flutter_learning_app
Catalog: lib/l10n/app_*.arb
Languages: de, ja, ko, zh

# tutorial_faq_q2
source: Where to import QR / JSON?
de: Wo importiere ich QR / JSON?
ja: QR / JSON のインポート場所は？
zh: 匯入 QR / JSON 在哪裡？

# tutorial_faq_a2
source: The leftmost/rightmost entry in the mini-card viewer, or “More” menu → “Import”.
de: Ganz links/rechts im Viewer oder im „Mehr“-Menü unter „Importieren“.
ja: ビューアの最左／最右ページ、または「その他」→「インポート」。
zh: 小卡檢視頁最左或最右的入口；或在更多選單找到「匯入」。

# tutorial_faq_q3
source: What are tags for?
de: Wofür sind Tags?
ja: タグの役割は？
zh: 標籤有什麼用？

# tutorial_faq_a3
source: Tags help quick filtering in the mini-card viewer; search becomes more precise.
de: Zum schnellen Filtern und präziseren Suchen im Viewer.
ja: タグで素早く絞り込み、検索もより正確に。
zh: 標籤可在小卡檢視頁做快速篩選，搜尋也更精準。

# tutorial_faq_q4
source: How to change language & theme?
de: Wie ändere ich Sprache & Thema?
ja: 言語とテーマの変更方法は？
zh: 如何變更語言與主題？

# tutorial_faq_a4
source: Go to “More → Settings” to switch app language and light/dark theme.
de: Über „Mehr → Einstellungen“ Sprache und Hell/Dunkel wechseln.
ja: 「その他 → 設定」でアプリ言語とライト／ダークを切替。
zh: 前往「更多 → 設定」切換 App 語言與深 / 淺色主題。

# tutorial_faq_q5
source: Where do social posts appear?
de: Wo erscheinen Social-Beiträge?
ja: 投稿はどこに表示されますか？
zh: 社群貼文在哪出現？

# tutorial_faq_a5
source: Your posts appear in “Hot” and “Friends”; friends can see and interact.
de: In „Trends“ und „Freunde“; Freunde können interagieren.
ja: 「注目」と「友達」に表示。友達が閲覧・交流できます。
zh: 你的貼文會出現在「熱門」與「好友」分頁；好友可看到並互動。

# postHintShareSomething
source: Share something…
de: Teile etwas …
ja: 何かをシェアしましょう…
zh: 分享點什麼…

# postAlbum
source: Album
ja: アルバム
zh: 相簿

# postPublish
source: Post
de: Veröffentlichen
ja: 投稿
zh: 發佈

# postTags
source: Tags
ja: タグ
zh: 標籤

# postAddTagHint
source: Add a tag and press Enter
de: Tag hinzufügen und Enter drücken
ja: タグを追加して Enter を押す
zh: 新增標籤，按 Enter

# postAdd
source: Add
de: Hinzufügen
ja: 追加
zh: 加入

# postTagLimit
source: Tag limit {max}
de: Max. {max} Tags
ja: タグは最大 {max} 個
zh: 標籤最多 {max} 個

source: Current Plan
de: Aktueller Plan
ja: 現在のプラン
zh: 目前方案

source: Filter
ja: 絞り込み
zh: 篩選

# filterPanelTitle
source: Filter cards
de: Karten filtern
ja: カードを絞り込む
zh: 篩選卡片

# filterClear
source: Clear
de: Zurücksetzen
ja: クリア
zh: 清除

# filterSearchHint
source: Search name, note, serial…
de: Nach Name, Notiz oder Seriennummer suchen…
ja: 名前・メモ・シリアル番号で検索…
zh: 搜尋名稱、備註、序號…

# extraInfoSectionTitle
source: More details
de: Weitere Details
ja: その他の情報
zh: 其他資訊

# fieldStageNameLabel
source: Stage name / nickname
de: Künstlername / Spitzname
ja: 芸名・ニックネーム
zh: 暱稱／藝名

# fieldGroupLabel
source: Group / series
de: Gruppe / Serie
ja: グループ・シリーズ
zh: 團體／系列

# fieldOriginLabel
source: Card source
de: Kartenquelle
ja: カードの入手元
zh: 卡片來源

# fieldNoteLabel
source: Notes
de: Notizen
ja: メモ
zh: 備註

# profileSectionTitle
source: Profile
de: Grunddaten
ja: 基本プロフィール
zh: 基本資訊

# noQuotePlaceholder
source: No quote yet
de: Noch kein Zitat eingetragen
ja: まだ一言メッセージがありません
zh: 尚未寫下句子

# cardNameAlreadyExists
source: A card named "{name}" already exists. Please use another name.
de: Eine Karte mit dem Namen „{name}“ existiert bereits. Bitte verwenden Sie einen anderen Namen.
ja: 「{name}」という名前のカードは既に存在します。別の名前を入力してください。
zh: 已經有名為「{name}」的人物卡了，請換一個名稱。

# deleteCardAndMiniCardsMessage
source: Are you sure you want to delete "{name}"? All mini cards under this person will also be removed.
de: Möchten Sie „{name}“ wirklich löschen? Alle zugehörigen Mini-Karten werden ebenfalls entfernt.
ja: 「{name}」を削除しますか？この人物に関連するすべてのミニカードも削除されます。
zh: 確定要刪除「{name}」嗎？此動作也會一併刪除此人物底下的所有小卡。

# socialProfileTitle
source: Profile
de: Profil
ja: プロフィール
zh: 個人資料

# userProfileLongPressHint
source: Long-press to edit your profile
de: Lange drücken, um dein Profil zu bearbeiten.
ja: 長押ししてプロフィールを編集
zh: 長按編輯個人資料

# scanFriendQrTitle
source: Scan name card QR to add friend
de: Visitenkarten-QR scannen, um Freund hinzuzufügen
ja: 名刺QRをスキャンして友達追加
zh: 掃描名片 QR 加好友

# scanFriendQrButtonLabel
source: Scan card to add friend
de: Visitenkarte scannen
ja: 名刺をスキャンして追加
zh: 掃描名片加好友

# filterAlbumNone
source: No album
de: Kein Album
ja: アルバムなし
zh: 沒有專輯

# albumCollectionTitle
source: Album collection
de: Albensammlung
ja: アルバムコレクション
zh: 專輯收藏

# albumCollectionEmptyHint
source: You don't have any albums yet. Start by adding your favorite one.
de: Du hast noch keine Alben. Fang damit an, dein Lieblingsalbum hinzuzufügen.
ja: まだアルバムがありません。まずはいちばん好きな一枚から追加してみてください。
zh: 目前還沒有專輯，先從你最喜歡的一張開始新增吧。

# albumSwipeEdit
source: Edit
de: Bearbeiten
ja: 編集
zh: 編輯

# albumSwipeDelete
source: Delete
de: Löschen
ja: 削除
zh: 刪除

# albumDialogAddTitle
source: Add album
de: Album hinzufügen
ja: アルバムを追加
zh: 新增專輯

# albumDialogEditTitle
source: Edit album
de: Album bearbeiten
ja: アルバムを編集
zh: 編輯專輯

# albumDialogFieldTitle
source: Album title
de: Albumtitel
ja: アルバム名
zh: 專輯名稱

# albumDialogFieldArtist
source: Artist / group
de: Künstler / Gruppe
ja: アーティスト／グループ
zh: 藝人／團體

# albumDialogFieldYear
source: Year (optional)
de: Erscheinungsjahr (optional)
ja: 発売年（任意）
zh: 年份（選填）

# albumDialogFieldCover
source: Cover image URL (optional)
de: Cover-Bild-URL (optional)
ja: ジャケット画像のURL（任意）
zh: 封面圖片 URL（選填）

# albumDialogFieldYoutube
source: YouTube link (optional)
ja: YouTubeリンク（任意）
zh: YouTube 連結（選填）

# albumDialogFieldYtmusic
source: YT Music link (optional)
ja: YT Musicリンク（任意）
zh: YT Music 連結（選填）

# albumDialogFieldSpotify
source: Spotify link (optional)
ja: Spotifyリンク（任意）
zh: Spotify 連結（選填）

# albumDialogAddConfirm
source: Add
de: Hinzufügen
ja: 追加
zh: 加入

# albumDialogEditConfirm
source: Save
de: Speichern
ja: 保存
zh: 儲存

# albumDeleteConfirmTitle
source: Delete album
de: Album löschen
ja: アルバムを削除
zh: 刪除專輯

# albumDeleteConfirmMessage
source: Are you sure you want to delete "{title}"?
de: Möchtest du „{title}“ wirklich löschen?
ja: 「{title}」を削除してもよろしいですか？
zh: 確定要刪除「{title}」嗎？

# albumDetailReleaseYear
source: Release year: {year}
de: Erscheinungsjahr: {year}
ja: 発売年：{year}
zh: 發行年份：{year}

# albumDetailNoStreaming
source: No streaming links set yet.
de: Es wurden noch keine Streaming-Links hinterlegt.
ja: ストリーミングのリンクはまだ設定されていません。
zh: 尚未設定串流連結

# albumDetailHint
source: You can later add the track list, your comments, or reasons for recommendation here.
de: Später kannst du hier die Trackliste, deine Kommentare oder Gründe für deine Empfehlung eintragen.
ja: あとでここに曲目リストやコメント、おすすめの理由などを書くことができます。
zh: 之後可以在這裡放曲目列表、你的評語或推薦理由等等。

# albumTracksSectionTitle
source: Tracks
de: Titel
ja: 収録曲
zh: 收錄歌曲

# albumNoTracksHint
source: No tracks have been added to this album yet.
de: Diesem Album wurden bisher noch keine Titel hinzugefügt.
ja: このアルバムにはまだ曲が追加されていません。
zh: 這張專輯目前還沒有新增任何歌曲。

# albumFieldLanguage
source: Language
de: Sprache
ja: 言語
zh: 語言

# albumFieldVersion
source: Version / Edition
de: Version
ja: バージョン
zh: 版本

# albumCoverFromUrlLabel
source: From URL
de: Aus URL
ja: URL から
zh: 使用網址

# albumCoverFromLocalLabel
source: From local image
de: Lokales Bild verwenden
ja: 端末内の画像
zh: 使用本機圖片

# albumFieldArtistsLabel
source: Artists
de: Künstler*innen
ja: アーティスト
zh: 演出者

# albumFieldArtistsInputHint
source: Type an artist name and press Enter to add…
de: Künstlernamen eingeben und mit Enter hinzufügen…
ja: アーティスト名を入力して Enter で追加…
zh: 輸入演出者名稱後按 Enter 新增…

# albumArtistsSuggestionHint
source: Suggestions will appear while you type.
de: Während der Eingabe werden Vorschläge angezeigt.
ja: 入力中に候補が表示されます。
zh: 輸入時會顯示建議名稱。

# albumLinksSectionTitle
source: Streaming links
ja: ストリーミングリンク
zh: 串流連結

# albumAddTrackButtonLabel
source: Add track
de: Titel hinzufügen
ja: 楽曲を追加
zh: 新增歌曲

# albumTrackDialogAddTitle
source: Add track
de: Titel hinzufügen
ja: 楽曲を追加
zh: 新增歌曲

# albumTrackDialogEditTitle
source: Edit track
de: Titel bearbeiten
ja: 楽曲を編集
zh: 編輯歌曲

# albumTrackFieldTitle
source: Track title
de: Titelname
ja: 楽曲名
zh: 歌曲名稱

# albumTitleRequiredMessage
source: Please enter an album title.
de: Bitte einen Albumnamen eingeben.
ja: アルバム名を入力してください。
zh: 請輸入專輯名稱。

# albumCoverLocalRequiredMessage
source: Please choose a local cover image.
de: Bitte ein lokales Coverbild auswählen.
ja: ローカルのジャケット画像を選択してください。
zh: 請選擇本機封面圖片。

# albumDetailLanguage
source: Language: {lang}
de: Sprache: {lang}
ja: 言語：{lang}
zh: 語言：{lang}

# albumDetailVersion
source: Version: {ver}
ja: バージョン：{ver}
zh: 版本：{ver}

# albumTrackImageLabel
source: Track image (optional)
de: Titelbild (optional)
ja: 楽曲画像（任意）
zh: 歌曲圖片（可選）

# albumTrackClearImageTooltip
source: Clear image
de: Bild entfernen
ja: 画像を削除
zh: 清除圖片

# albumTrackImageUseAlbumHint
source: If no image is set, this track will use the album cover.
de: Wenn kein Bild festgelegt ist, wird für diesen Titel das Albumcover verwendet.
ja: 画像を設定しない場合、この曲にはアルバムのジャケット画像が表示されます。
zh: 若未設定圖片，將會使用專輯封面顯示這首歌曲。

# albumImportJsonTitle
source: Import album JSON
ja: アルバム JSON をインポート
zh: 匯入專輯 JSON

# albumImportJsonHint
source: Paste the album JSON here. You can paste a single album object or a list of albums.
ja: ここにアルバムの JSON を貼り付けてください。1 つのアルバムオブジェクト、または複数アルバムの配列を貼り付けることができます。
zh: 請將專輯的 JSON 貼在這裡，可以是單一專輯物件，或多張專輯的陣列。

# albumImportSuccess
source: Albums imported successfully.
ja: アルバムのインポートが完了しました。
zh: 專輯匯入成功。

# albumImportFailed
source: Import failed: {error}
ja: インポートに失敗しました：{error}
zh: 匯入失敗：{error}

# albumAddNewAlbum
source: Add Album
ja: アルバムを追加
zh: 新增專輯

# chatHint
source: Type a message…
zh: 輸入訊息…

# socialNewConversation
source: New Conversation
zh: 新增對話

# socialMembersHint
source: Add members…
zh: 加入成員…

# socialConversationNameOptional
source: Conversation name (optional)
zh: 對話名稱（可選填）

# socialMessagesTitle
source: Messages
zh: 訊息

# syncMenuTitle
source: Sync & Download
zh: 同步與下載

# syncMenuSubtitle
source: Back up your cards and albums to the cloud, or download them back to this device.
zh: 將卡片與專輯資料備份到雲端，或從雲端下載到本機。

# syncPageTitle
source: Sync & Download
zh: 同步與下載

# syncPageDesc
source: You can manually upload the cards and albums on this device as a cloud file, or download it from the cloud to overwrite local data. We recommend uploading before changing devices or reinstalling the app.
zh: 你可以手動將目前裝置上的卡片與專輯資料，上傳成一個雲端檔案，或是從雲端下載回來覆蓋本機資料。建議在更換手機或重裝 App 前先執行上傳。

# syncUploadButton
source: Upload to Cloud
zh: 上傳到雲端

# syncDownloadButton
source: Download from Cloud
zh: 從雲端下載

# syncCopyButton
source: Copy File Content
zh: 複製檔案內容

# syncRefreshPreview
source: Reload Preview
zh: 重新載入預覽

# syncPreviewTitle
source: Cloud Data Preview
zh: 雲端資料預覽

# syncPreviewSubtitle
source: Below is the content of the library file currently stored in the cloud (JSON).
zh: 以下是目前儲存在雲端的 library 檔案內容（JSON）。

# syncPreviewEmptyHint
source: No cloud file found. Try uploading first.
zh: 目前還沒有雲端檔案，可以先按「上傳到雲端」。

# syncNoRemoteData
source: No cloud library file found. Please upload from this device first.
zh: 找不到雲端 library 檔案，請先在這台裝置上傳一次。

# syncUploadSuccess
source: Upload and sync completed.
zh: 上傳並同步完成。

# syncUploadFailed
source: Upload failed: {error}
zh: 上傳失敗：{error}

# syncDownloadSuccess
source: Downloaded from cloud and applied to local data.
zh: 已從雲端下載並套用到本機。

# syncDownloadFailedGeneric
source: Failed to download or apply from the cloud. Please try again later.
zh: 從雲端下載或套用失敗，稍後再試一次。

# syncCopyNoData
source: No data to copy. Please load the cloud file first.
zh: 目前沒有可以複製的資料，請先載入雲端檔案。

# syncCopySuccess
source: Cloud file content copied to clipboard.
zh: 已將雲端檔案內容複製到剪貼簿。

# syncPaidOnlyHint
source: Cloud sync and download are available only for paid plans. After subscribing, you can back up, download, and copy the full library file.
zh: 雲端同步與下載功能僅提供付費方案使用。訂閱後，你可以備份、下載與複製完整的 library 檔案。

# syncNeedSubTitle
source: Subscription Required
zh: 需要訂閱方案

# syncNeedSubBody
source: Cloud sync and download are only available for paid plans. Please go to the subscription page and select Basic / Plus / Pro before trying again.
zh: 雲端同步與下載功能僅限付費方案使用。請先前往訂閱頁面選擇 Basic / Plus / Pro 方案後再試一次。

# syncGoToSubscription
source: Go to Subscription
zh: 前往訂閱

# dialogCancel
source: Cancel
zh: 取消

# qrCodeTab
source: QR code
ja: QR コード
ko: QR 코드
