Repository: jimmylee16888/flutter_learning_app
Catalog: lib/l10n/app_*.arb
Languages: de, ja, ko, zh

# authSignInWithGoogle
source: Sign in with Google
de: Mit Google anmelden
ja: Google でサインイン
ko: Google로 로그인
zh: 使用 Google 登入

source: Continue as Guest
de: Als Gast fortfahren
ja: ゲストとして続行
ko: 게스트로 계속
zh: 以訪客使用

# noNetworkGuestTip
source: You're offline. You can continue as a guest.
de: Sie sind offline. Sie können als Gast fortfahren.
ja: 現在オフラインです。ゲストとして利用できます。
ko: 현재 오프라인입니다. 게스트로 이용할 수 있습니다.
zh: 目前離線，您可改以訪客使用

# navCards
source: Cards
de: Karten
ja: カード
ko: 카드
zh: 卡片

# navExplore
source: Explore
de: Entdecken
ja: 探索
ko: 탐색
zh: 探索

# navSettings
source: Settings
de: Einstellungen
ja: 設定
ko: 설정
zh: 設定

# settingsTitle
source: Settings
de: Einstellungen
ja: 設定
ko: 설정
zh: 設定

source: Theme
de: Design
ja: テーマ
ko: 테마
zh: 主題

# themeSystem
source: System
ja: システム
ko: 시스템
zh: 跟隨系統

# themeLight
source: Light
de: Hell
ja: ライト
ko: 라이트
zh: 淺色

# themeDark
source: Dark
de: Dunkel
ja: ダーク
ko: 다크
zh: 深色

source: Language
de: Sprache
ja: 言語
ko: 언어
zh: 語言

# languageSystem
source: System
ja: システム
ko: 시스템
zh: 跟隨系統

# languageZhTW
source: Traditional Chinese
de: Traditionelles Chinesisch
ja: 繁体字中国語
ko: 번체 중국어
zh: 繁體中文

# languageEn
source: English
de: Englisch
ja: 英語
ko: 영어
zh: 英文

# languageJa
source: Japanese
de: Japanisch
ja: 日本語
ko: 일본어
zh: 日文

# languageKo
source: Korean
de: Koreanisch
ja: 韓国語
ko: 한국어
zh: 韓語

# languageDe
source: German
de: Deutsch
ja: ドイツ語
ko: 독일어
zh: 德語

# aboutTitle
source: About
de: Info
ja: 情報
ko: 정보
zh: 關於

source: About Developer
de: Über den Entwickler
ja: 開発者について
ko: 개발자 소개
zh: 關於開發者

# developerRole
source: Developer
de: Entwickler
ja: 開発者
ko: 개발자
zh: 開發者

# emailLabel
source: Email
ja: メール
ko: 이메일
zh: 電子郵件

# versionLabel
source: Version
ja: バージョン
ko: 버전
zh: 版本

source: Birthday
de: Geburtstag
ja: 誕生日
ko: 생일
zh: 生日

# quoteTitle
source: A message to fans
de: Eine Nachricht an die Fans
ja: ファンへのメッセージ
ko: 팬에게 한마디
zh: 給粉絲的一句話

source: Fan mini cards
de: Fan-Minikarten
ja: ファンミニカード
ko: 팬 미니 카드
zh: 粉絲小卡

# noMiniCardsHint
source: No mini cards yet. Tap "Edit" to add.
de: Noch keine Minikarten. Tippe auf „Bearbeiten“, um welche hinzuzufügen.
ja: ミニカードはまだありません。「編集」をタップして追加してください。
ko: 아직 미니 카드가 없습니다. ‘편집’을 눌러 추가하세요.
zh: 尚無小卡，點「編輯」新增。

source: Add
de: Hinzufügen
ja: 追加
ko: 추가
zh: 新增

source: Edit mini cards
de: Minikarten bearbeiten
ja: ミニカードを編集
ko: 미니 카드 편집
zh: 編輯小卡

source: Save
de: Speichern
ja: 保存
ko: 저장
zh: 儲存

source: Edit
de: Bearbeiten
ja: 編集
ko: 편집
zh: 編輯

source: Delete
de: Löschen
ja: 削除
ko: 삭제
zh: 刪除

source: Cancel
de: Abbrechen
ja: キャンセル
ko: 취소
zh: 取消

source: Preview failed
de: Vorschau fehlgeschlagen
ja: プレビューに失敗しました
ko: 미리보기에 실패했습니다
zh: 預覽失敗

source: Favorite
de: Favorit
ja: お気に入り
ko: 즐겨찾기
zh: 收藏

source: Favorited
de: Als Favorit markiert
ja: お気に入り済み
ko: 즐겨찾기에 추가됨
zh: 已收藏

# accountStatusGuest
source: Guest mode
de: Gastmodus
ja: ゲストモード
ko: 게스트 모드
zh: 訪客模式

# accountStatusSignedIn
source: Signed in
de: Angemeldet
ja: ログイン済み
ko: 로그인됨
zh: 已登入

# accountStatusSignedOut
source: Signed out
de: Abgemeldet
ja: 未ログイン
ko: 로그인되지 않음
zh: 未登入

# accountGuestSubtitle
source: Using guest mode; data is stored only on this device
de: Im Gastmodus; Daten werden nur auf diesem Gerät gespeichert
ja: 現在はゲストとして利用中。データはこの端末のみに保存されます
ko: 현재 게스트로 사용 중입니다. 데이터는 이 기기에만 저장됩니다.
zh: 目前以訪客登入，資料僅存在本機

# accountNoInfo
source: (No account info)
de: (Keine Kontoinformationen)
ja: （アカウント情報なし）
ko: (계정 정보 없음)
zh: （無帳號資訊）

# accountBackToLogin
source: Go to sign-in
de: Zur Anmeldung
ja: ログイン画面へ
ko: 로그인 화면으로
zh: 回到登入頁

source: Sign out
de: Abmelden
ja: ログアウト
ko: 로그아웃
zh: 登出

# helloDeveloperTitle
source: Hello! I'm the developer
de: Hallo! Ich bin der Entwickler
ja: こんにちは！開発者です
ko: 안녕하세요! 개발자입니다
zh: 嗨！開發者在這裡

# helloDeveloperBody
source: Thank you for trying out this little side project 💫 I’m a proud FEARNOT (LE SSERAFIM fan)! Every time I want to share the joy of collecting photocards with friends, I hate having to carry a whole stack around — so I made this app 💡. Now you can easily show and trade your cards with just a 6.5-inch phone. I’ll keep updating and improving this tiny project, and I’m truly grateful that you downloaded it and became part of it (or, cutely put, part of the family 🩷). If you have any ideas or feedback, feel free to reach out anytime! 💪
de: Danke, dass du dieses kleine Side Project ausprobierst 💫 Ich bin ein großer LE SSERAFIM-Fan (FEARNOT)! Jedes Mal, wenn ich die Freude am Photocard-Sammeln mit Freunden teilen will, finde ich es mühsam, einen ganzen Stapel mitzunehmen – also habe ich diese App gemacht 📱. Jetzt kannst du deine Karten ganz einfach mit nur einem 6,5-Zoll-Handy zeigen und tauschen. Ich werde dieses kleine Projekt weiterhin pflegen und verbessern, und ich bin wirklich dankbar, dass du es heruntergeladen und ein Teil davon geworden bist (oder, süßer gesagt, Teil der Familie 🩷). Wenn du Ideen oder Vorschläge hast, schreib mir einfach jederzeit! 💪
ja: この小さなサイドプロジェクトを試してくれてありがとう💫 私は LE SSERAFIM の大ファン（FEARNOT）です！友達にフォトカードの喜びを共有したいけど、たくさんのカードを持ち歩くのは大変なので、このアプリを作りました📱。6.5インチのスマホ1台で簡単にカードを見せたり交換したりできます。 これからも少しずつアップデートしていくので、ダウンロードして家族（と言ってもいいよね🩷）の一員になってくれて本当にありがとう！もし何かアイデアや意見があれば、いつでも気軽に教えてね💪
ko: 이 작은 사이드 프로젝트를 사용해 주셔서 감사합니다. 저는 LE SSERAFIM을 정말 좋아하는 FEARNOT이고, 친구들과 기쁨을 나눌 때마다 두꺼운 포토카드를 들고 다니고 싶지는 않았습니다. 그래서 이 앱을 만들었습니다. 6.5인치 화면에서 바로 카드를 보여주고 교환할 수 있도록요. 앞으로도 계속 유지보수하고, 코드는 GitHub에서 오픈으로 유지하겠습니다. 다운로드해 주시고 이 프로젝트(말하자면 작은 가족)의 일원이 되어 주셔서 다시 한 번 감사합니다. 개선 아이디어나 질문이 있으면 언제든 연락해 주세요. — Jimmy Lee
zh: 謝謝你願意試試這個小 side project。我是 LE SSERAFIM 的忠實粉絲（FEARNOT），但每次想跟朋友分享喜悅，都不想背一疊小卡，所以做了這個 App——讓大家用一支 6.5 吋手機就能展示、交換小卡。我會持續維護，再次感謝下載，成為這個專案的一小份子（可愛一點說，就是家人）。如果有任何問題或改進想法，隨時聯絡我。— Jimmy Lee

# stats_title
source: Statistics
de: Statistiken
ja: 統計
ko: 통계
zh: 統計

# stats_overview
source: Collection Overview
de: Sammlungsübersicht
ja: コレクション概要
ko: 컬렉션 개요
zh: 收藏概覽

# stats_artist_count
source: Number of artists
de: Anzahl der Künstler*innen
ja: アーティスト数
ko: 아티스트 수
zh: 藝人數量

# stats_card_total
source: Total mini cards
de: Gesamtzahl der Minikarten
ja: ミニカード総数
ko: 미니 카드 총합
zh: 小卡總數

# stats_front_source
source: Front image source
de: Bildquelle der Vorderseite
ja: 表面画像のソース
ko: 앞면 이미지 출처
zh: 正面圖片來源

# stats_cards_per_artist_topN
source: Mini cards per artist (Top {n})
de: Minikarten pro Künstler (Top {n})
ja: アーティストごとのミニカード数（トップ {n}）
ko: 아티스트별 미니 카드 수 (상위 {n})
zh: 各藝人小卡數（前 {n} 名）

# common_local
source: Local
de: Lokal
ja: ローカル
ko: 로컬
zh: 本地

# common_url
source: URL
zh: 網址

# common_unnamed
source: (Unnamed)
de: (Ohne Namen)
ja: （無名）
ko: (이름 없음)
zh: （未命名）

# common_unit_cards
source: cards
de: Karten
ja: 枚
ko: 장
zh: 張

# welcomeTitle
source: Welcome to Mini Cards
de: Willkommen bei Mini Cards
ja: ミニカードへようこそ
ko: Mini Cards에 오신 것을 환영합니다
zh: 歡迎使用小卡管理

# welcomeSubtitle
source: Sign in or create an account to sync settings and data
de: Melde dich an oder erstelle ein Konto, um Einstellungen und Daten zu synchronisieren
ja: 設定とデータを同期するには、サインインまたはアカウント作成してください
ko: 설정과 데이터를 동기화하려면 로그인하거나 계정을 만드세요
zh: 登入或建立帳號以同步設定與資料

# authSignIn
source: Sign in
de: Anmelden
ja: サインイン
ko: 로그인
zh: 登入

# authRegister
source: Register
de: Registrieren
ja: 登録
ko: 등록
zh: 註冊

# authContinueAsGuest
source: Continue as guest
de: Als Gast fortfahren
ja: ゲストとして続行
ko: 게스트로 계속
zh: 以訪客登入

# authAccount
source: Account (Email / any string)
de: Konto (E-Mail / beliebige Zeichenfolge)
ja: アカウント（メール／任意の文字列）
ko: 계정 (이메일/임의 문자열)
zh: 帳號（Email/任意字串）

# authPassword
source: Password
de: Passwort
ja: パスワード
ko: 비밀번호
zh: 密碼

# authCreateAndSignIn
source: Create account and sign in
de: Konto erstellen und anmelden
ja: アカウント作成してサインイン
ko: 계정 만들기 및 로그인
zh: 建立帳號並登入

# authName
source: Name
ja: 名前
ko: 이름
zh: 姓名

# authGender
source: Gender
de: Geschlecht
ja: 性別
ko: 성별
zh: 性別

# genderMale
source: Male
de: Männlich
ja: 男性
ko: 남성
zh: 男性

# genderFemale
source: Female
de: Weiblich
ja: 女性
ko: 여성
zh: 女性

# genderOther
source: Other/Prefer not to say
de: Divers/keine Angabe
ja: その他／無回答
ko: 기타/비공개
zh: 其他/不透露

# birthdayPick
source: Pick date
de: Datum wählen
ja: 日付を選択
ko: 날짜 선택
zh: 選擇日期

# errorLoginFailed
source: Login failed
de: Anmeldung fehlgeschlagen
ja: サインインに失敗しました
ko: 로그인 실패
zh: 登入失敗

# errorRegisterFailed
source: Register failed
de: Registrierung fehlgeschlagen
ja: 登録に失敗しました
ko: 등록 실패
zh: 註冊失敗

# errorPickBirthday
source: Please select your birthday
de: Bitte wähle deinen Geburtstag
ja: 誕生日を選択してください
ko: 생일을 선택하세요
zh: 請選擇生日

# stats_nav_subtitle
source: See collection stats: totals, sources, top artists
de: Statistiken ansehen: Gesamtzahlen, Quellen, Top-Artists
ja: コレクション統計：総数・ソース分布・トップアーティスト
ko: 총합, 출처, 상위 아티스트 등 통계를 확인하세요
zh: 查看收藏統計：總數、來源分布、各藝人 Top

# filterAll
source: All
de: Alle
ja: すべて
ko: 전체
zh: 全部

# deleteCategoryTitle
source: Delete category
de: Kategorie löschen
ja: カテゴリを削除
ko: 카테고리 삭제
zh: 刪除分類

# deleteCategoryMessage
source: Delete “{name}”? This will also be removed from all cards.
de: „{name}“ wirklich löschen? Die Kategorie wird von allen Karten entfernt.
ja: 「{name}」を削除しますか？（すべてのカードからも削除されます）
ko: “{name}”을(를) 삭제하시겠습니까? 모든 카드에서 제거됩니다.
zh: 確定要刪除「{name}」嗎？（會從所有卡片移除）

# deletedCategoryToast
source: Deleted category: {name}
de: Kategorie gelöscht: {name}
ja: カテゴリを削除しました：{name}
ko: 카테고리 삭제됨: {name}
zh: 已刪除分類：{name}

# searchHint
source: Search name / card text
de: Name/Kartentext suchen
ja: 名前／カード内容を検索
ko: 이름/카드 내용 검색
zh: 搜尋人名／卡片內容

source: Clear
de: Löschen
ja: クリア
ko: 지우기
zh: 清除

source: No cards
de: Keine Karten
ja: カードがありません
ko: 카드가 없습니다
zh: 沒有卡片

source: Add card
de: Karte hinzufügen
ja: カードを追加
ko: 카드 추가
zh: 新增藝人卡

# deleteCardTitle
source: Delete card
de: Karte löschen
ja: カードを削除
ko: 카드 삭제
zh: 刪除卡片

# deleteCardMessage
source: Delete “{title}”?
de: „{title}“ wirklich löschen?
ja: 「{title}」を削除しますか？
ko: “{title}”을(를) 삭제하시겠습니까?
zh: 確定要刪除「{title}」嗎？

# deletedCardToast
source: Deleted: {title}
de: Gelöscht: {title}
ja: 削除しました：{title}
ko: 삭제됨: {title}
zh: 已刪除：{title}

source: Edit card
de: Karte bearbeiten
ja: カードを編集
ko: 카드 편집
zh: 編輯卡片

# categoryAssignOrAdd
source: Assign / add categories
de: Kategorien zuweisen/hinzufügen
ja: カテゴリを割り当て／追加
ko: 카테고리 지정/추가
zh: 指派／新增分類

# newCardTitle
source: New card
de: Neue Karte
ja: 新規カード
ko: 새 카드
zh: 新增藝人卡

# editCardTitle
source: Edit card
de: Karte bearbeiten
ja: カードを編集
ko: 카드 편집
zh: 編輯卡片

# nameRequiredLabel
source: Name (required)
de: Name (erforderlich)
ja: 名前（必須）
ko: 이름(필수)
zh: 名稱（必填）

# imageByUrl
source: By URL
de: Per URL
ja: URL から
ko: URL로
zh: 以網址

# imageByLocal
source: Local photo
de: Lokales Foto
ja: ローカル写真
ko: 로컬 사진
zh: 本地照片

source: Image URL
de: Bild-URL
ja: 画像 URL
ko: 이미지 URL
zh: 圖片 URL

# pickFromGallery
source: Choose from gallery
de: Aus Galerie wählen
ja: ギャラリーから選択
ko: 갤러리에서 선택
zh: 從相簿選擇

# quoteOptionalLabel
source: Quote (optional)
de: Zitat (optional)
ja: 引用（任意）
ko: 인용문(선택)
zh: 語錄（可選）

source: Pick birthday (optional)
de: Geburtstag wählen (optional)
ja: 誕生日を選択（任意）
ko: 생일 선택(선택)
zh: 選擇生日（可選）

# inputImageUrl
source: Please enter image URL
de: Bitte Bild-URL eingeben
ja: 画像の URL を入力してください
ko: 이미지 URL을 입력하세요
zh: 請輸入圖片網址

source: Download failed
de: Download fehlgeschlagen
ja: ダウンロードに失敗しました
ko: 다운로드 실패
zh: 下載失敗

# pickLocalPhoto
source: Please choose a local photo
de: Bitte lokales Foto wählen
ja: ローカル写真を選択してください
ko: 로컬 사진을 선택하세요
zh: 請選擇本地照片

# updatedCardToast
source: Card updated
de: Karte aktualisiert
ja: カードを更新しました
ko: 카드가 업데이트되었습니다
zh: 已更新卡片

# manageCategoriesTitle
source: Manage categories
de: Kategorien verwalten
ja: カテゴリ管理
ko: 카테고리 관리
zh: 管理分類

# newCategoryNameHint
source: New category name
de: Neuer Kategoriename
ja: 新しいカテゴリ名
ko: 새 카테고리 이름
zh: 新增分類名稱

source: Add category
de: Kategorie hinzufügen
ja: カテゴリを追加
ko: 카테고리 추가
zh: 新增分類

# deleteCategoryTooltip
source: Delete category
de: Kategorie löschen
ja: カテゴリを削除
ko: 카테고리 삭제
zh: 刪除分類

# assignCategoryTitle
source: Assign categories
de: Kategorien zuweisen
ja: カテゴリを割り当て
ko: 카테고리 지정
zh: 指派分類

source: Confirm
de: Bestätigen
ja: 確認
ko: 확인
zh: 確定

# confirmDeleteCategoryMessage
source: Delete “{name}”? This category will be removed from all cards.
de: „{name}“ wirklich löschen? Die Kategorie wird von allen Karten entfernt.
ja: 「{name}」を削除しますか？すべてのカードからも削除されます。
ko: “{name}”을(를) 삭제하시겠습니까? 모든 카드에서 제거됩니다.
zh: 確定刪除「{name}」？此分類會從所有卡片移除。

# addedCategoryToast
source: Added category: {name}
de: Kategorie hinzugefügt: {name}
ja: カテゴリを追加しました：{name}
ko: 카테고리 추가됨: {name}
zh: 已新增分類：{name}

# noMiniCardsPreviewHint
source: No mini cards yet. Tap here or swipe up to add.
de: Noch keine Mini-Karten. Klicken Sie hier oder wischen Sie nach oben, um eine hinzuzufügen.
ja: まだミニカードはありません。ここをタップするか、上にスワイプして追加してください。
ko: 아직 미니 카드가 없습니다. 여기를 클릭하거나 위로 스와이프하여 추가하세요.
zh: 尚無小卡，點此或上滑進入新增。

# detailSwipeHint
source: Swipe up to open mini-cards (scan/share QR inside)
de: Wischen Sie nach oben, um zur Mini-Karten-Seite zu gelangen (einschließlich Scan/QR-Teilen).
ja: 上にスワイプしてミニカードページ（スキャン／QR共有を含む）へ。
ko: 위로 스와이프하여 미니 카드 페이지로 이동하세요 (스캔/QR 공유 포함).
zh: 上滑進入小卡頁（內含掃描／分享 QR）

# noMiniCardsEmptyList
source: No mini cards yet. Tap + to add.
de: Derzeit keine Mini-Karten. Klicken Sie unten rechts auf +, um eine hinzuzufügen.
ja: 現在、ミニカードはありません。右下の＋をタップして追加してください。
ko: 현재 미니 카드가 없습니다. 오른쪽 하단의 +를 눌러 추가하세요.
zh: 目前沒有小卡，點右下＋新增。

# miniLocalImageBadge
source: Local image
de: Lokales Bild
ja: ローカル画像
ko: 로컬 이미지
zh: 本地圖片

# miniHasBackBadge
source: Has back image
de: Mit Bild der Rückseite
ja: 裏面画像あり
ko: 뒷면 이미지 포함
zh: 含背面圖片

# tagsLabel
source: Tags
ja: タグ
ko: 태그
zh: 標籤

# tagsCount
source: Tags {n}
ja: タグ {n}
ko: 태그 {n}
zh: 標籤 {n}

# nameLabel
source: Name
ja: 名前
ko: 이름
zh: 名稱

source: Serial number
de: Seriennummer
ja: シリアル番号
ko: 일련번호
zh: 序號

source: Album
ja: アルバム
ko: 앨범
zh: 專輯

source: Add album
de: Album hinzufügen
ja: アルバムを追加
ko: 앨범 추가
zh: 新增專輯

source: Enter album name
de: Albumnamen eingeben
ja: アルバム名を入力
ko: 앨범 이름 입력
zh: 輸入專輯名稱

source: Card type
de: Kartentyp
ja: カード種別
ko: 카드 종류
zh: 卡種

source: Add card type
de: Kartentyp hinzufügen
ja: カード種別を追加
ko: 카드 종류 추가
zh: 新增卡種

source: Enter card type name
de: Kartentypnamen eingeben
ja: カード種別名を入力
ko: 카드 종류 이름 입력
zh: 輸入卡種名稱

# noteLabel
source: Note
de: Anmerkung
ja: 備考
ko: 비고
zh: 備註

# newTagHint
source: Add a tag…
de: Neuen Tag hinzufügen…
ja: 新しいタグを追加…
ko: 새 태그 추가…
zh: 新增標籤…

# frontSide
source: Front
de: Vorderseite
ja: 表面
ko: 앞면
zh: 正面

# backSide
source: Back
de: Rückseite
ja: 裏面
ko: 뒷면
zh: 背面

# frontImageTitle
source: Front image
de: Bild der Vorderseite
ja: 表面画像
ko: 앞면 이미지
zh: 正面圖片

# backImageTitleOptional
source: Back image (optional)
de: Bild der Rückseite (optional)
ja: 裏面画像（任意）
ko: 뒷면 이미지 (선택 사항)
zh: 背面圖片（可留空）

# frontImageUrlLabel
source: Front image URL
de: URL des Bildes der Vorderseite
ja: 表面画像URL
ko: 앞면 이미지 URL
zh: 正面圖片網址

# backImageUrlLabel
source: Back image URL
de: URL des Bildes der Rückseite
ja: 裏面画像URL
ko: 뒷면 이미지 URL
zh: 背面圖片網址

source: Clear URL
de: URL löschen
ja: URLをクリア
ko: URL 지우기
zh: 清除網址

source: Clear local
de: Lokal löschen
ja: ローカルをクリア
ko: 로컬 지우기
zh: 清除本地

source: Clear back image
de: Bild der Rückseite löschen
ja: 裏面画像をクリア
ko: 뒷면 이미지 지우기
zh: 清除背面圖

# localPickedLabel
source: Picked: Local
de: Ausgewählt: Lokal
ja: 選択済み：ローカル
ko: 선택됨: 로컬
zh: 已選：本地

# miniCardEditTitle
source: Edit mini card
de: Mini-Karte bearbeiten
ja: ミニカードを編集
ko: 미니 카드 편집
zh: 編輯小卡

# miniCardNewTitle
source: New mini card
de: Neue Mini-Karte
ja: 新しいミニカード
ko: 새 미니 카드
zh: 新增小卡

# errorFrontImageUrlRequired
source: Please enter the front image URL or switch to Local.
de: Bitte geben Sie eine URL für das Bild der Vorderseite ein oder wechseln Sie zu lokal.
ja: 表面画像のURLを入力するか、ローカルに切り替えてください。
ko: 앞면 이미지 URL을 입력하거나 로컬로 전환하세요.
zh: 請輸入正面圖片網址或切換為本地。

# errorFrontLocalRequired
source: Please choose a local front photo or switch to URL.
de: Bitte wählen Sie ein lokales Foto der Vorderseite aus oder wechseln Sie zurück zur URL.
ja: 表面のローカル写真を選択するか、URLに戻してください。
ko: 앞면 로컬 사진을 선택하거나 URL로 다시 전환하세요.
zh: 請選擇正面本地照片或切回網址。

# userProfileTitle
source: User profile
de: Benutzer
ja: ユーザー
ko: 사용자 설정
zh: 使用者

# userProfileTile
source: User profile
de: Benutzer
ja: ユーザー
ko: 사용자 설정
zh: 使用者

# nicknameLabel
source: Nickname
de: Spitzname
ja: ニックネーム
ko: 닉네임
zh: 暱稱

# nicknameRequired
source: Nickname is required
de: Spitzname ist erforderlich
ja: ニックネームを入力してください
ko: 닉네임은 필수입니다
zh: 暱稱不可空白

source: Not set
de: Nicht festgelegt
ja: 未設定
ko: 미설정
zh: 未設定

source: Clear birthday
de: Geburtstag löschen
ja: 誕生日をクリア
ko: 생일 지우기
zh: 清除生日

# userProfileSaved
source: Profile saved
de: Benutzereinstellungen gespeichert
ja: ユーザー設定を保存しました
ko: 사용자 설정이 저장되었습니다
zh: 已儲存使用者設定

# ready
source: All set
de: Fertig
ja: 完了
ko: 완료
zh: 已完成

# fillNicknameAndBirthday
source: Please fill in nickname and birthday
de: Bitte Spitzname und Geburtstag ausfüllen
ja: ニックネームと誕生日を入力してください
ko: 닉네임과 생일을 입력해 주세요
zh: 請填寫暱稱與生日

# navSocial
source: Social
de: Sozial
ja: ソーシャル
ko: 소셜
zh: 社群

# timeJustNow
source: just now
de: Gerade eben
ja: たった今
ko: 방금 전
zh: 剛剛

# timeMinutesAgo
source: {n} min ago
de: vor {n} Min.
ja: {n} 分前
ko: {n}분 전
zh: {n} 分鐘前

# timeHoursAgo
source: {n} hr ago
de: vor {n} Std.
ja: {n} 時間前
ko: {n}시간 전
zh: {n} 小時前

# timeDaysAgo
source: {n} day(s) ago
de: vor {n} Tagen
ja: {n} 日前
ko: {n}일 전
zh: {n} 天前

# socialFriends
source: Friends
de: Freunde
ja: 友達
ko: 친구
zh: 好友

# socialHot
source: Hot
de: Beliebt
ja: 人気
ko: 인기
zh: 熱門

# socialFollowing
source: Following
de: Folge ich
ja: フォロー中
ko: 팔로잉
zh: 追蹤

source: Publish
de: Veröffentlichen
ja: 投稿
ko: 게시
zh: 發佈

# socialShareHint
source: What's on your mind?
de: Woran denkst du gerade?
ja: 今なにしてる？
ko: 무슨 생각을 하고 있나요?
zh: 想分享什麼？

# leaveACommentHint
source: Leave a comment…
de: Einen Kommentar schreiben…
ja: コメントを入力…
ko: 댓글을 남겨보세요…
zh: 留下你的想法…

# commentsTitle
source: Comments
de: Kommentare
ja: コメント
ko: 댓글
zh: 留言

# commentsCount
source: Comments ({n})
de: Kommentare ({n})
ja: コメント（{n}）
ko: 댓글 {n}개
zh: 留言（{n}）

# addTagHint
source: Add a tag…
de: Tag hinzufügen…
ja: タグを追加…
ko: 태그 추가…
zh: 新增標籤…

source: Followed #{tag}
de: #{tag} gefolgt
ja: #{tag} をフォローしました
ko: #{tag} 팔로우함
zh: 已追蹤 #{tag}

source: Unfollowed #{tag}
de: Folgen für #{tag} entfernt
ja: #{tag} のフォローを解除しました
ko: #{tag} 팔로우 해제
zh: 已取消追蹤 #{tag}

# friendCardsTitle
source: Friend cards
de: Freundekarten
ja: 友だち名刺
ko: 친구 명함
zh: 好友名片

# addFriendCard
source: Add card
de: Karte hinzufügen
ja: 名刺を追加
ko: 명함 추가
zh: 新增名片

# editFriendCard
source: Edit card
de: Karte bearbeiten
ja: 名刺を編集
ko: 명함 편집
zh: 編輯名片

# scanQr
source: Scan QR code
de: QR-Code scannen
ja: QRコードをスキャン
ko: QR 코드 스캔
zh: 掃描 QRCode

source: Tap to flip
de: Tippen zum Umdrehen
ja: タップで反転
ko: 탭하여 뒤집기
zh: 點擊可翻面

# deleteFriendCardTitle
source: Delete card
de: Karte löschen
ja: 名刺を削除
ko: 명함 삭제
zh: 刪除名片

# deleteFriendCardMessage
source: Delete “{name}”?
de: „{name}“ löschen?
ja: 「{name}」を削除しますか？
ko: “{name}”을(를) 삭제하시겠습니까?
zh: 確定刪除「{name}」嗎？

# followArtistsLabel
source: Followed artists
de: Verfolgte Künstler
ja: フォロー中のアーティスト
ko: 팔로우하는 아티스트
zh: 追蹤的藝人

# limitReached
source: Limit reached ({text})
de: Limit erreicht ({text})
ja: 上限に達しました（{text}）
ko: 최대 한도에 도달했습니다 ({text})
zh: 已達上限（{text}）

# searchFriendsOrArtistsHint
source: Search friends or artists
de: Freunde oder Künstler suchen
ja: 友達やアーティストを検索
ko: 친구 또는 아티스트 검색
zh: 搜尋好友或藝人

source: Retry
de: Erneut versuchen
ja: 再試行
ko: 다시 시도
zh: 重試

# offlineBanner
source: Offline: some features are unavailable
de: Offline: Einige Funktionen sind nicht verfügbar
ja: オフライン：一部の機能は利用できません
ko: 오프라인: 일부 기능을 사용할 수 없습니다
zh: 離線中：部分功能不可用

# manageFollowedTags
source: Followed tags
de: Verfolgte Tags
ja: フォロー中のタグ
ko: 팔로우한 태그
zh: 追蹤標籤

source: No friends yet
de: Noch keine Freunde
ja: まだ友だちがいません
ko: 추가된 친구가 없습니다
zh: 尚未加入任何好友

# friendAddAction
source: Add friend
de: Freund hinzufügen
ja: 友だちに追加
ko: 친구 추가
zh: 加入好友

# friendRemoveAction
source: Remove friend
de: Freund entfernen
ja: 友だち解除
ko: 친구 해제
zh: 解除好友

# friendAddedStatus
source: Added
de: Hinzugefügt
ja: 追加済み
ko: 추가됨
zh: 已加入

source: Remove
de: Entfernen
ja: 削除
ko: 제거
zh: 移除

source: Change avatar
de: Avatar ändern
ja: アバターを変更
ko: 아바타 변경
zh: 更換頭像

# socialLinksTitle
source: Social links
de: Soziale Links
ja: ソーシャルリンク
ko: 소셜 링크
zh: 社群連結

source: Show Instagram on profile
de: Instagram im Profil anzeigen
ja: プロフィールに Instagram を表示
ko: 프로필에 Instagram 표시
zh: 在個人頁顯示 Instagram

source: Show Facebook on profile
de: Facebook im Profil anzeigen
ja: プロフィールに Facebook を表示
ko: 프로필에 Facebook 표시
zh: 在個人頁顯示 Facebook

source: Show Line on profile
de: LINE im Profil anzeigen
ja: プロフィールに LINE を表示
ko: 프로필에 LINE 표시
zh: 在個人頁顯示 Line

# followedTagsCount
source: Followed tags ({n})
de: Verfolgte Tags ({n})
ja: フォロー中のタグ（{n}）
ko: 팔로우한 태그 ({n})
zh: 追蹤的標籤（{n}）

source: Add followed tag
de: Verfolgten Tag hinzufügen
ja: フォローするタグを追加
ko: 팔로우할 태그 추가
zh: 新增追蹤標籤

# addFollowedTagHint
source: Enter a tag name, then press Enter
de: Gib einen Tagnamen ein und drücke Enter
ja: タグ名を入力して Enter を押してください
ko: 태그 이름을 입력한 뒤 Enter 키를 누르세요
zh: 輸入標籤名稱，按 Enter 加入

source: Manage cards
de: Visitenkarten verwalten
ja: 名刺を管理
ko: 명함 관리
zh: 管理名片

# phoneLabel
source: Phone
de: Telefon
ja: 電話
ko: 전화
zh: 電話

# followedTagsTitle
source: Followed tags
de: Verfolgte Tags
ja: フォロー中のタグ
ko: 팔로우한 태그
zh: 追蹤的標籤

source: No followed tags yet
de: Noch keine verfolgten Tags
ja: フォロー中のタグはありません
ko: 팔로우한 태그가 없습니다
zh: 尚未追蹤任何標籤

# addedFollowedTagToast
source: Added followed tag
de: Tag wurde hinzugefügt
ja: タグをフォローしました
ko: 태그를 팔로우했습니다
zh: 已加入追蹤標籤

# addFollowedTagFailed
source: Failed to add tag: {error}
de: Hinzufügen fehlgeschlagen: {error}
ja: 追加に失敗しました：{error}
ko: 추가 실패: {error}
zh: 新增失敗：{error}

# removedFollowedTagToast
source: Removed followed tag
de: Tag wurde entfernt
ja: タグのフォローを解除しました
ko: 태그 팔로우를 해제했습니다
zh: 已移除追蹤標籤

# removeFollowedTagFailed
source: Failed to remove tag: {error}
de: Entfernen fehlgeschlagen: {error}
ja: 削除に失敗しました：{error}
ko: 삭제 실패: {error}
zh: 移除失敗：{error}

# loadFailed
source: Failed to load: {error}
de: Laden fehlgeschlagen: {error}
ja: 読み込みに失敗しました：{error}
ko: 불러오기에 실패했습니다: {error}
zh: 讀取失敗：{error}

# miniCardsOf
source: {title}'s mini cards
de: Mini-Cards von {title}
ja: {title} のミニカード
ko: {title}의 미니 카드
zh: {title} 的小卡

# importFromJsonTooltip
source: Import from JSON
de: Aus JSON importieren
ja: JSON からインポート
ko: JSON에서 가져오기
zh: 從 JSON 匯入

# exportJsonMultiTooltip
source: Export JSON (multiple)
de: JSON exportieren (mehrere)
ja: JSON をエクスポート（複数）
ko: JSON 내보내기(여러 개)
zh: 匯出 JSON（多張）

source: Scan
de: Scannen
ja: スキャン
ko: 스캔
zh: 掃描

source: Share
de: Teilen
ja: 共有
ko: 공유
zh: 分享

source: Share this card
de: Diese Karte teilen
ja: このカードを共有
ko: 이 카드를 공유
zh: 分享此卡

# importedMiniCardsToast
source: Imported {n} mini card(s)
de: {n} Mini-Cards importiert
ja: {n} 枚のミニカードをインポートしました
ko: 미니 카드 {n}장을 가져왔습니다
zh: 已匯入 {n} 張小卡

# shareMultipleCards
source: Share multiple cards (multi-select)
de: Mehrere Karten teilen (Mehrfachauswahl)
ja: 複数のカードを共有（複数選択）
ko: 여러 카드 공유(다중 선택)
zh: 分享多張卡片（多選）

# shareMultipleCardsSubtitle
source: Select cards, then share photos or export JSON
de: Karten auswählen, dann Fotos teilen oder JSON exportieren
ja: カードを選択してから、写真共有または JSON エクスポート
ko: 카드를 선택한 뒤, 사진 공유 또는 JSON 내보내기
zh: 先勾選卡片，之後分享照片或匯出 JSON

# shareOneCard
source: Pick one to share…
de: Eine Karte zum Teilen auswählen…
ja: 1 枚を選んで共有…
ko: 한 장 선택하여 공유…
zh: 選一張分享…

# selectCardsForJsonTitle
source: Select cards to share (JSON)
de: Karten zum Teilen auswählen (JSON)
ja: 共有するカードを選択（JSON）
ko: 공유할 카드 선택(JSON)
zh: 選擇要分享的卡片（JSON）

# selectCardsForShareOrExportTitle
source: Select cards to share / export
de: Karten zum Teilen/Exportieren auswählen
ja: 共有／エクスポートするカードを選択
ko: 공유/내보낼 카드 선택
zh: 選擇要分享／匯出的卡片

# blockedLocalImageNote
source: Contains local image; cannot export to JSON
de: Enthält lokale Bilder; Export nach JSON nicht möglich
ja: ローカル画像を含むため JSON にはエクスポートできません
ko: 로컬 이미지를 포함하여 JSON으로 내보낼 수 없습니다
zh: 包含本地圖片；無法匯出為 JSON

# shareMultiplePhotos
source: Share {n} photos
de: {n} Fotos teilen
ja: {n} 枚の写真を共有
ko: 사진 {n}장 공유
zh: 分享 {n} 張照片

source: Export JSON
de: JSON exportieren
ja: JSON をエクスポート
ko: JSON 내보내기
zh: 匯出 JSON
